# Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 5
b = 0.5
c = 'text'
d = (1, 2)
e = [4, 5, 6, 7]

print(f'Объект {a} имеет тип {type(a)}')
print(f'Объект {b} имеет тип {type(b)}')
print(f'Объект {c} имеет тип {type(c)}')
print(f'Объект {d} имеет тип {type(d)}')
print(f'Объект {e} имеет тип {type(e)}')